-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2016-04-25 14:07:24
-- 服务器版本： 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `china_culture`
--

-- --------------------------------------------------------

--
-- 表的结构 `c_article`
--

CREATE TABLE IF NOT EXISTS `c_article` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(50) NOT NULL,
  `author` varchar(20) NOT NULL,
  `time` date NOT NULL,
  `file_name` varchar(20) NOT NULL,
  `represent` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

--
-- 转存表中的数据 `c_article`
--

INSERT INTO `c_article` (`id`, `title`, `author`, `time`, `file_name`, `represent`) VALUES
(1, '浮伤年华,让泪化作相思雨', '落花飘零', '2016-04-22', 'test.xml', '那一年初秋，我和你在雨中相遇。我撑着伞悠然地在雨帘中行走，而你被雨淋得一身狼狈，却毫不在意，还露出愉悦的表情。和你擦肩而过的那一刻，我想要回头叫住你，想知道你为什么会在雨中笑得那么开心。可是最后我只是握紧了伞柄继续向前走，而你永远也不知道就在那短短的几秒里你走进了我的心里，依然阔步向前。我们的距离越来越远，当我鼓起勇气回头的时候，你已经不见了，消失在那年初秋的第一场雨中。'),
(2, '有人就有江湖，有江湖就有恩怨', '未知', '2016-04-22', 'jianghu.xml', '有人就有江湖，有江湖就有恩怨，人就是江湖，你怎么退出？真正的寂寞是在骨子里的，是觉得全世界只剩下了自己。欲将轻骑逐，大雪满弓刀，这势必是一场鏖战！御剑江湖载酒行，美人如玉翩若鸿。十年一剑情如梦，赢得生前身后名。我只是隐约地看到一个风华正茂的年轻剑客，缓缓的收起自己的剑，抬脚踏出了自己的江湖路。开始想念，那曾经握在手中苍凉的岁月，以及那一片灿烂的江湖，还有那些曾经爱过恨过的人们。 '),
(3, '书剑恩仇录', '金庸', '1955-01-01', 'shujian.xml', '周绮身孕在身，留在福建生产；陈家洛和其他英雄赶往京城。此时回部全军覆没，香香公主被擒，乾隆欲据为己有，香香公主宁死不从。陈家洛与乾隆相见，以国家利益为重，答应帮助劝说香香公主；香香公主含泪答应了陈家洛，后发现乾隆并不真想反清复明，遂自杀以示陈家洛。陈家洛伤心之余，抱着最后一线希望进入皇宫，险被毒死。众英雄大开杀戒，天山双鹰与红花会十当家章进身亡，最后捉住乾隆。'),
(4, '来世，等你在天青色的雨巷', '未知', '2016-04-22', 'laishi.xml', '幽思入琴弦，心开如莲。轻声昵咛，柔情呼唤。一想一眷恋，一思一哀伤。镜中瘦颜，青丝一寸，愁绪一丈。书中长恨，泪墨惨淡尘土。“落花人独立，微雨燕双飞。”一缕相思于眉间清清浅浅，浅浅清清。一抹柔情于指间千回百转百转千回。杏花细雨，揉不碎曾经的过往，荡不尽逝水流年。如莲心事一念成痴，尘缘如梦，思念悠悠云水长');

-- --------------------------------------------------------

--
-- 表的结构 `c_author`
--

CREATE TABLE IF NOT EXISTS `c_author` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `a_name` varchar(20) NOT NULL,
  `a_dynasty` varchar(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=36 ;

--
-- 转存表中的数据 `c_author`
--

INSERT INTO `c_author` (`id`, `a_name`, `a_dynasty`) VALUES
(1, '李白', '唐朝'),
(2, '杜甫', '唐朝'),
(4, '陶渊明', '东晋→南北朝'),
(5, '屈原', '战国'),
(6, '曹操', '三国'),
(7, '曹植', '三国'),
(8, '骆宾王', '唐朝'),
(9, '贺知章', '唐朝'),
(10, '王之涣', '唐朝'),
(11, '孟浩然', '唐朝'),
(12, '王昌龄', '唐朝'),
(13, '王维', '唐朝'),
(14, '岑参', '唐朝'),
(15, '韦应物', '唐朝'),
(16, '白居易', '唐朝'),
(17, '刘禹锡', '唐朝'),
(18, '柳宗元', '唐朝'),
(19, '杜牧', '唐朝'),
(20, '李商隐', '唐朝'),
(21, '温庭筠', '唐朝'),
(22, '王勃', '唐朝'),
(23, '陈子昂', '唐朝'),
(24, '王安石', '宋朝'),
(25, '苏轼', '北宋'),
(26, '李清照', '南宋'),
(27, '岳飞', '南宋'),
(28, '陆游', '南宋'),
(29, '杨万里', '南宋'),
(30, '辛弃疾', '南宋'),
(31, '朱熹', '南宋'),
(32, '叶绍翁', '南宋'),
(33, '文天祥', '南宋'),
(34, '龚自珍', '清朝'),
(35, '王冕', '元末');

-- --------------------------------------------------------

--
-- 表的结构 `c_idiom`
--

CREATE TABLE IF NOT EXISTS `c_idiom` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `content` varchar(20) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=117 ;

--
-- 转存表中的数据 `c_idiom`
--

INSERT INTO `c_idiom` (`id`, `content`) VALUES
(1, '天下无双'),
(2, '金玉良缘'),
(3, '霸王别姬'),
(4, '偷天换日'),
(5, '满腹经纶'),
(6, '情非得已'),
(7, '珠光宝气'),
(8, '两小无猜'),
(9, '兵临城下'),
(10, '纸上谈兵'),
(11, '声东击西'),
(12, '南辕北辙'),
(13, '草木皆兵'),
(14, '虚有其表'),
(15, '金玉满堂'),
(16, '天上人间'),
(17, '海阔天空'),
(18, '春暖花开'),
(19, '国色天香'),
(20, '倾国倾城'),
(21, '插翅难逃'),
(22, '在劫难逃'),
(23, '掌上明珠'),
(24, '卧虎藏龙'),
(25, '相亲相爱'),
(26, '逍遥法外'),
(27, '皆大欢喜'),
(28, '度日如年'),
(29, '绘声绘色'),
(30, '百里挑一'),
(31, '背水一战'),
(32, '万箭穿心'),
(33, '长生不死'),
(34, '金枝玉叶'),
(35, '滔滔不绝'),
(36, '壮志凌云'),
(37, '卧薪尝胆'),
(38, '相濡以沫'),
(39, '落叶归根'),
(40, '海市蜃楼'),
(41, '惊天动地'),
(42, '愚公移山'),
(43, '天地不容'),
(44, '抛砖引玉'),
(45, '窈窕淑女'),
(46, '无地自容'),
(47, '无忧无虑'),
(48, '高山流水'),
(49, '相见恨晚'),
(50, '四海为家'),
(51, '生财有道'),
(52, '破釜沉舟'),
(53, '天涯海角'),
(54, '精忠报国'),
(55, '亡羊补牢'),
(56, '千军万马'),
(57, '妄自菲薄'),
(58, '出生入死'),
(59, '英雄豪杰'),
(60, '学富五车'),
(61, '石破天惊'),
(62, '福星高照'),
(63, '随遇而安'),
(64, '翻雨覆雨'),
(65, '饮食男女'),
(66, '郑人买履'),
(67, '鹰击长空'),
(68, '万家灯火'),
(69, '棋逢对手'),
(70, '叶公好龙'),
(71, '后会无期'),
(72, '守株待兔'),
(73, '一生一世'),
(74, '花好月圆'),
(75, '树外桃园'),
(76, '韬光养晦'),
(77, '画蛇添足'),
(78, '青梅竹马'),
(79, '风花雪月'),
(80, '滥竽充数'),
(81, '总而言之'),
(82, '没完没了'),
(83, '欣欣向荣'),
(84, '时光荏苒'),
(85, '差强人意'),
(86, '好好先生'),
(87, '无懈可击'),
(88, '随波逐流'),
(89, '袖手旁观'),
(90, '群雄逐鹿'),
(91, '血战到底'),
(92, '唯我独尊'),
(93, '买椟还珠'),
(94, '龙马精神'),
(95, '一见钟情'),
(96, '喜闻乐见'),
(97, '负荆请罪'),
(98, '三人成虎'),
(99, '程门立雪'),
(100, '金戈铁马'),
(101, '笑逐颜开'),
(102, '千钧一发'),
(103, '大器晚成'),
(104, '风和日丽'),
(105, '庖丁解牛'),
(106, '甜言蜜语'),
(107, '雷霆万钧'),
(108, '邯郸学步'),
(109, '大开眼界'),
(110, '汗牛充栋'),
(111, '百鸟朝凤'),
(112, '以德服人'),
(113, '白驹过隙'),
(114, '指鹿为马'),
(115, '龙争虎斗'),
(116, '未雨绸缪');

-- --------------------------------------------------------

--
-- 表的结构 `c_pdetail`
--

CREATE TABLE IF NOT EXISTS `c_pdetail` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `p_id` int(11) NOT NULL,
  `p_author_id` int(11) NOT NULL,
  `title` varchar(50) NOT NULL,
  `p_content` text NOT NULL,
  `p_note` text NOT NULL,
  `p_analysis` text NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `p_id` (`p_id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=11 ;

--
-- 转存表中的数据 `c_pdetail`
--

INSERT INTO `c_pdetail` (`id`, `p_id`, `p_author_id`, `title`, `p_content`, `p_note`, `p_analysis`) VALUES
(1, 3, 1, '望庐山瀑布', '望庐山瀑布二首⑴<br/>\r\n其一<br/>\r\n西登香炉峰⑵，南见瀑布水⑶。\r\n挂流三百丈⑷，喷壑数十里⑸。<br/>\r\n欻如飞电来，隐若白虹起⑹。\r\n初惊河汉落⑺，半洒云天里⑻。<br/>\r\n仰观势转雄，壮哉造化功⑼。\r\n海风吹不断，江月照还空⑽。<br/>\r\n空中乱潈射，左右洗青壁⑾；\r\n飞珠散轻霞，流沫沸穹石⑿。<br/>\r\n而我乐名山⒀，对之心益闲⒁；\r\n无论漱琼液⒂，还得洗尘颜⒃。<br/>\r\n且谐宿所好，永愿辞人间⒄。<br/>\r\n其二<br/>\r\n日照香炉生紫烟，遥看瀑布挂前川⒅。<br/>\r\n飞流直下三千尺⒆，疑是银河落九天⒇。<br/>', '⑴庐山：又名匡山，中国名山之一。位于今江西省九江市北部的鄱阳湖盆地，在庐山区境内，耸立于鄱阳湖、长江之滨。<br/>\r\n⑵香炉峰：庐山香炉峰有四。此指南香炉峰。因烟云聚散，如香炉之状，故名。关于香炉峰的位置，各注本有多种说法。<br/>\r\n⑶南见：一作“南望”。<br/>\r\n⑷三百丈：一作“三千匹”。<br/>\r\n⑸“喷壑”句：意谓瀑布喷射山谷，一泻数十里。壑（hè）：坑谷。<br/>\r\n⑹“欻如”二句：意谓快如闪电而来，隐似白虹而起。此二句化用沈约《八咏诗·被褐守山东》“掣曳写流电，奔飞似白虹”句意。歘（xū）：迅疾貌。飞电：空中闪电。一作“飞练”。隐若：一作“宛若”。白虹：一种出现在雾上的淡白色的虹。<br/>\r\n⑺河汉：银河，又称天河。一作“银河”。<br/>\r\n⑻“半洒”句：一作“半泻金潭里”。<br/>\r\n⑼造化：自然界的创造者，此指大自然。<br/>\r\n⑽“江月”句：意谓瀑布在江月的映照下，显得更加清澈。江月：一作“山月”。<br/>\r\n⑾“空中”二句：意谓瀑布在奔流过程中所激起的水花，四处飞溅，冲刷着左右青色的山壁。潈（zōng）：众水汇在一起。<br/>\r\n⑿穹（qióng）石：高大的石头。<br/>\r\n⒀乐：爱好。乐名山：一作“游名山”。<br/>\r\n⒁益：更加。闲：宽广的意思。<br/>\r\n⒂无论：不必说。漱：漱洗。琼液：传说中仙人的饮料。此指山中清泉。<br/>\r\n⒃还得：但得。一作“且得”。尘颜：沾满风尘的脸。洗尘颜：喻指洗除在尘世中所沾染的污垢。<br/>\r\n⒄“且谐”二句：一作“集谱宿所好，永不归人间”，又一作“爱此肠欲断，不能归人间”。谐：谐和。宿：旧。宿所好：素来的爱好。一解为旧友。<br/>\r\n⒅“日照”二句：一作“庐山上与星斗连，日照香炉生紫烟”。香炉：指香炉峰。紫烟：指日光透过云雾，远望如紫色的烟云。孟浩然《彭蠡湖中望庐山》：“香炉初上日，瀑布喷成虹。”遥看：从远处看。挂：悬挂。前川：一作“长川”。川：河流，这里指瀑布。<br/>\r\n⒆直：笔直。三千尺：形容山高。这里是夸张的说法，不是实指。<br/>\r\n⒇疑：怀疑。银河：古人指银河系构成的带状星群。九天：极言天高。古人认为天有九重，九天是天的最高层，九重天，即天空最高处。一作“半天”。此句极言瀑布落差之大。[2]  [3]  [4] ', '其一\r\n从西面登上庐山的香炉峰，看见南面瀑布高挂在山前。\r\n瀑布高高悬挂达到三百丈，喷涌出的溪水有数十里长。\r\n瀑布水流迅疾如同闪电般，时隐时现恰如空中升白虹。\r\n初看以为银河从九天垂落，河水从云天高处半洒而下。\r\n抬头仰观那气势更加雄伟，大自然造化之功多么壮阔！\r\n海天之风吹不断瀑布水练，江上明月照来又如同空无。\r\n瀑布水花在空中四溅乱射，冲洗着两侧青色的山石壁。\r\n水珠飞溅犹如轻霞般四散，流淌的水沫在巨石上翻滚。\r\n我平生素来喜爱游览名山，面临此瀑布更觉心里闲逸。\r\n不必说可吸饮如琼液之水，还可以用来洗去途中尘颜。\r\n还是与旧友相携一道到此，在这里隐居永远辞别人间。\r\n其二\r\n太阳照耀香炉峰生出袅袅紫烟，远远望去瀑布像长河悬挂山前。\r\n仿佛三干尺水流飞奔直冲而下，莫非是银河从九天垂落山崖间。[3] '),
(2, 2, 1, '静夜思', '床前明月光⑵，疑是地上霜⑶。<br>\r\n举头望明月⑷，低头思故乡。[1-2] ', '⑴静夜思：安静的夜晚产生的思绪。<br/>\r\n⑵床：此诗中的“床”字，是争论和异议的焦点。今传五种说法。①指井台。②指井栏。从考古发现来看，中国最早的水井是木结构水井。古代井栏有数米高，成方框形围住井口，防止人跌入井内，这方框形既像四堵墙，又像古代的床。因此古代井栏又叫银床，说明井和床有关系，其关系的发生则是由于两者在形状上的相似和功能上的类同。③“窗”的通假字。从意义上讲，“床”可能与‘窗’通假，而且在窗户前面是可能看到月亮的。但是，参照宋代版本，‘举头望山月’，便可证实作者所言乃是室外的月亮。从时间上讲，宋代版本比明代版本在对作者原意的忠诚度上，更加可靠。④取本义，即坐卧的器具，《诗经·小雅·斯干》有“载寐之牀”，《易·剥牀·王犊注》亦有“在下而安者也”之说，讲得即是卧具。⑤马未都等认为，床应解释为胡床。胡床，亦称“交床”、“交椅”、“绳床”。古时一种可以折叠的轻便坐具，马扎功能类似小板凳，但人所坐的面非木板，而是可卷折的布或类似物，两边腿可合起来。现代人常为古代文献中或诗词中的“胡床”或“床”所误。至迟在唐时，“床”仍然是“胡床”（即马扎，一种坐具）。<br/>\r\n⑶疑：好像。<br/>\r\n⑷举头：抬头。[4]  [5] ', '窗前洒满了银色的月光，好像地上结了一层薄霜。\r\n抬头凝望着空中的明月，不禁低头思念我的故乡。[6-7] '),
(3, 4, 1, '早发白帝城', '朝辞白帝彩云间⑵，千里江陵一日还⑶。<br/>\r\n两岸猿声啼不住⑷，轻舟已过万重山⑸。[1] ', '⑴发：启程。白帝城：故址在今重庆市奉节县白帝山上。杨齐贤注：“白帝城，公孙述所筑。初，公孙述至鱼复，有白龙出井中，自以承汉土运，故称白帝，改鱼复为白帝城。”王琦注：“白帝城，在夔州奉节县，与巫山相近。所谓彩云，正指巫山之云也。”<br/>\r\n⑵朝：早晨。辞：告别。彩云间：因白帝城在白帝山上，地势高耸，从山下江中仰望，仿佛耸入云间。白帝：今四川省奉节县东白帝山，山上有白帝城，位于长江上游。<br/>\r\n⑶江陵：今湖北荆州市。从白帝城到江陵约一千二百里，其间包括七百里三峡。郦道元《三峡》：“自三峡七百里中，两岸连山，略无阙处。重岩叠障，隐天蔽日，自非亭午时分，不见曦月。至于夏水襄陵，沿溯（或泝）阻绝。或王命急宣，有时朝发白帝，暮到江陵，其间千二百时里，虽乘奔御风，不以疾也。春冬之时，则素湍绿潭，回清倒影。绝巘（或巚）多生怪柏，悬泉瀑布，飞漱其间。清荣峻茂，良多趣味。每至晴初霜旦，林寒涧肃，常有高猿长啸，属引凄异。空谷传响，哀啭久绝。故渔者歌曰：‘巴东三峡巫峡长，猿鸣三声泪沾裳。’”一日还：一天就可以到达；还：归；返回。<br/>\r\n⑷猿：猿猴。啼：鸣、叫。住：停息。<br/>\r\n⑸万重山：层层叠叠的山，形容有许多。[2-3] <br/>', '清晨我告别高入云霄的白帝城；江陵远在千里船行只一日时间。\r\n两岸猿声还在耳边不停地啼叫；不知不觉轻舟已穿过万重青山。[4] '),
(4, 5, 1, '夜宿山寺', '危楼高百尺⑵，手可摘星辰⑶。<br/>\r\n不敢高声语⑷，恐惊天上人⑸。[1] <br/>', '⑴宿：住，过夜。<br/>\r\n⑵危楼：高楼，这里指山顶的寺庙。危：高。百尺：虚指，不是实数，这里形容楼很高。<br/>\r\n⑶星辰：天上的星星统称。<br/>\r\n⑷语：说话。<br/>\r\n⑸恐：唯恐，害怕。惊：惊动。[1]<br/> ', '山上寺院的高楼真高啊，好像有一百尺的样子，人在楼上好像一伸手就可以摘下天上的星星。\r\n站在这里，我不敢大声说话，唯恐（害怕）惊动天上的神仙。[1] '),
(5, 6, 1, '送孟浩然之广陵', '故人西辞黄鹤楼⑵，烟花三月下扬州⑶。<br/>\r\n孤帆远影碧空尽⑷，唯见长江天际流⑸。[3] <br/>', '⑴黄鹤楼：中国著名的名胜古迹，故址在今湖北武汉市武昌蛇山的黄鹄矶上，属于长江下游地带，传说三国时期的费祎于此登仙乘黄鹤而去，故称黄鹤楼。原楼已毁，现存楼为1985年修葺。孟浩然：李白的朋友。之：往、到达。广陵：即扬州。<br/>\r\n⑵故人：老朋友，这里指孟浩然。其年龄比李白大，在诗坛上享有盛名。李白对他很敬佩，彼此感情深厚，因此称之为“故人”。辞：辞别。<br/>\r\n⑶烟花：形容柳絮如烟、鲜花似锦的春天景物，指艳丽的春景。下：顺流向下而行。<br/>\r\n⑷碧空尽：消失在碧蓝的天际。尽：尽头，消失了。碧空：一作“碧山”。<br/>\r\n⑸唯见：只看见。天际流：流向天边 天际：天边，天边的尽头。[4]  [5] <br/>', '友人在黄鹤楼向我挥手告别，阳光明媚的三月他要去扬州。\r\n他的帆影渐渐消失在碧空中，只看见滚滚长江在天边奔流。[4]  [5] '),
(6, 7, 1, '望天门山', '天门中断楚江开⑵，碧水东流至此回⑶。<br/>\r\n两岸青山相对出⑷，孤帆一片日边来⑸。[1] <br/>', '⑴天门山：位于安徽省和县与芜湖市长江两岸，在江北的叫西梁山，在江南的叫东梁山（古代又称博望山）。两山隔江对峙，形同天设的门户，天门由此得名。《江南通志》记云：“两山石状晓岩，东西相向，横夹大江，对峙如门。俗呼梁山曰西梁山，呼博望山曰东梁山，总谓之天门山。”<br/>\r\n⑵中断：江水从中间隔断两山。楚江：即长江。因为古代长江中游地带属楚国，所以叫楚江。开：劈开，断开。<br/>\r\n⑶至此：意为东流的江水在这转向北流。一作“直北”。回：回漩，回转。指这一段江水由于地势险峻方向有所改变，并更加汹涌。<br/>\r\n⑷两岸青山：分别指东梁山和西梁山。出：突出，出现。<br/>\r\n⑸日边来：指孤舟从天水相接处的远方驶来，远远望去，仿佛来自日边。[2]  [3] <br/>', '长江犹如巨斧劈开天门雄峰，碧绿江水东流到此没有回旋。\r\n两岸青山对峙美景难分高下，遇见一叶孤舟悠悠来自天边。[2] '),
(7, 8, 1, '独坐敬亭山', '众鸟高飞尽⑵，孤云独去闲⑶。<br/>\r\n相看两不厌⑷，只有敬亭山。[1] <br/>', '⑴敬亭山：在今安徽宣城市北。《元和郡县志》记载：“在宣城县北十里。山有万松亭、虎窥泉。”《江南通志》卷一六宁国府：“敬亭山在府城北十里。府志云：古名昭亭，东临宛、句二水，南俯城闉，烟市风帆，极目如画。”<br/>\r\n⑵尽：没有了。<br/>\r\n⑶孤云：陶渊明《咏贫士诗》中有“孤云独无依”的句子。朱谏注：“言我独坐之时，鸟飞云散，有若无情而不相亲者。独有敬亭之山，长相看而不相厌也。” 独去闲：独去，独自去。 闲，形容云彩飘来飘去，悠闲自在的样子。孤单的云彩飘来飘去。<br/>\r\n⑷两不厌：指诗人和敬亭山而言。厌：满足。[2-3] <br/>', '群鸟高飞无影无踪，孤云独去自在悠闲。\r\n你看我，我看你，彼此之间两不相厌，只有我和眼前的敬亭山了。[4] '),
(8, 9, 1, '蜀道难', '<p class="p-indent">噫吁嚱（yī xūxī），危乎高哉！蜀道之难，难于上青天！（2）蚕丛及鱼凫（fú），开国何茫然！（3）尔来四万八千岁，不与秦塞（sài）通人烟。（4）西当太白有鸟道，可以横绝峨眉巅（diān)。（5）地崩山摧壮士死，然后天梯石栈（zhàn）相钩连。（6）上有六龙回日之高标，下有冲波逆折之回川。（7）黄鹤之飞尚不得过，猿猱（náo）欲度愁攀援。（8）青泥何盘盘，百步九折萦（yíng）岩峦。（9）扪参（mén shēn）历井仰胁息，以手抚膺（yīng）坐长叹。（10）</p>\r\n<p class="p-indent">问君西游何时还？畏途巉（chán）岩不可攀。（11）但见悲鸟号（háo）古木，雄飞雌从绕林间。（12）又闻子规啼夜月，愁空山。（13）蜀道之难，难于上青天，使人听此凋朱颜。（14）连峰去天不盈尺，枯松倒挂倚绝壁。（15）飞湍瀑（tuān pù）流争喧豗（huī），砯（pīng）崖转石万壑（hè）雷。（16）其险也如此，嗟（jiē）尔远道之人胡为乎来哉！（17）</p>\r\n<p class="p-indent">剑阁峥嵘而崔嵬（wéi），一夫当关，万夫莫开。（18）所守或匪（fěi）亲，化为狼与豺。（19）朝避猛虎，夕避长蛇；磨牙吮（shǔn）血（xuè），杀人如麻。（20）锦城虽云乐，不如早还（huán）家。（21）蜀道之难，难于上青天，侧身西望长咨嗟（zī jiē）！（22）[2-3]</p>', '（1）《蜀道难》：古乐府题，属《相和歌·瑟调曲》。<br/>\r\n（2）噫吁嚱：三个都是惊叹词。惊叹声，蜀方言，表示惊讶的声音。宋庠《宋景文公笔记》卷上：“蜀人见物惊异，辄曰‘噫吁嚱’。”<br/>\r\n（3）蚕丛、鱼凫：传说中古蜀国两位国王的名字；难以考证。何茫然：何：多么。茫然：完全不知道的样子。指古史传说悠远难详，不知道。据西汉扬雄《蜀本王纪》记载："蜀王之先，名蚕丛、柏灌、鱼凫，蒲泽、开明。……从开明上至蚕丛，积三万四千岁。"[4]<br/> \r\n（4）尔来：从那时以来。四万八千岁：极言时间之漫长，夸张而大约言之。秦塞：秦的关塞，指秦地。秦地四周有山川险阻，故称"四塞之地"。通人烟：人员往来。<br/>\r\n（5）西当：在西边的。当：在。太白：太白山，又名太乙山，在长安西（今陕西眉县、太白县一带）。鸟道：指连绵高山间的低缺处，只有鸟能飞过，人迹所不能至。横绝：横越。峨眉巅：峨眉顶峰。（注：苏教版语文课本为 “峨眉颠”）<br/>\r\n（6）地崩山摧壮士死：《华阳国志·蜀志》：相传秦惠王想征服蜀国，知道蜀王好色，答应送给他五个美女。蜀王派五位壮士去接人。回到梓潼（今四川剑阁之南）的时候，看见一条大蛇进入穴中，一位壮士抓住了它的尾巴，其余四人也来相助，用力往外拽。不多时，山崩地裂，壮士和美女都被压死。山分为五岭，入蜀之路遂通。这便是有名的“五丁开山”的故事。摧：倒塌。天梯：非常陡峭的山路。石栈：栈道。<br/>\r\n（7）六龙回日：《淮南子》注云：“日乘车，驾以六龙。羲和御之。日至此面而薄于虞渊，羲和至此而回六螭。”，意思就是传说中的羲和驾驶者六龙之车（即太阳）到此处便迫近虞渊（传说中的日落出）。高标：指蜀山中可作一方之标识的最高峰。 冲波：水流冲击腾起的波浪，这里指激流。逆折：水流回旋。回川：有漩涡的河流。<br/>\r\n（8）黄鹤：黄鹄（hú），善飞的大鸟。尚：尚且。得：能。猿猱（náo）：蜀山中最善攀援的猴类。<br/>\r\n（9）青泥：青泥岭，在今甘肃徽县南，陕西略阳县北。《元和郡县志》卷二十二：“青泥岭，在县西北五十三里，接溪山东，即今通路也。悬崖万仞，山多云雨，行者屡逢泥淖，故号青泥岭。”盘盘：曲折回旋的样子。百步九折：百步之内拐九道弯。萦：盘绕。岩峦：山峰。<br/>\r\n（10）扪参历井：参（shēn）、井是二星宿名。古人把天上的星宿分别指配于地上的州国，叫做“分野”，以便通过观察天象来占卜地上所配州国的吉凶。参星为蜀之分野，井星为秦之分野。扪（mén）：用手摸。历：经过。胁息：屏气不敢呼吸。膺：胸。坐：徒，空。<br/>\r\n（11）君：入蜀的友人。畏途：可怕的路途。巉岩：险恶陡峭的山壁。<br/>\r\n（12）但见：只听见。号古木：在古树木中大声啼鸣。从：跟随。<br/>\r\n（13）子规：即杜鹃鸟，蜀地最多，鸣声悲哀，若云“不如归去”。《蜀记》曰：“昔有人姓杜名宇，王蜀，号曰望帝。宇死，俗说杜宇化为子规。子规，鸟名也。蜀人闻子规鸣，皆曰望帝也。”这两句也有断为“又闻子规啼，夜月愁空山”的，但不如此文这种断法顺。<br/>\r\n（14）凋朱颜：红颜带忧色，如花凋谢。凋，使动用法，使……凋谢，这里指脸色由红润变成铁青。<br/>\r\n（15）去：距离。盈：满。<br/>\r\n（16）飞湍（tuān）：飞奔而下的急流。喧豗（huī）：喧闹声，这里指急流和瀑布发出的巨大响声。砯（pīng）崖：水撞石之声。砯，水冲击石壁发出的响声，这里作动词用，冲击的意思[5]  。转，使滚动。 壑：山谷。[4]<br/> \r\n（17）嗟：感叹声。尔：你。胡为：为什么。来：指入蜀。<br/>\r\n（18）剑阁：又名剑门关，在四川剑阁县北，是大、小剑山之间的一条栈道，长约三十余里。峥嵘、崔嵬，都是形容山势高大雄峻的样子。“一夫”两句：《文选》卷四左思《蜀都赋》：“一人守隘，万夫莫向”。《文选》卷五十六张载《剑阁铭》：“一人荷戟，万夫趦趄。形胜之地，匪亲勿居。”一夫：一人。当关：守关。莫开：不能打开。<br/>\r\n（19）所守：指把守关口的人。或匪亲：倘若不是可信赖的人。匪，同“非”。<br/>\r\n（20）朝：早上。吮：吸。<br/>\r\n（21）锦城：成都古代以产棉闻名，朝廷曾经设官于此，专收棉织品，故称锦城或锦官城。《元和郡县志》卷三十一剑南道成都府成都县：“锦城在县南十里，故锦官城也。”今四川成都市。<br/>\r\n（22）咨嗟：叹息。[4] <br/>', '啊！何其高竣，何其峭险！蜀道难走比登上青天还要难，古蜀国先王的事迹久远渺茫。岁月漫漫过去四万八千年，蜀道还未能与秦地相通人烟。西边太白山上只有一条鸟道，才能从秦地横越过峨眉山巅。山崩地裂压死迎亲的五壮士，才能修成栈道与陡峭山路相接，上有高峰神仙也要绕路而行，下有河川冲波倒流漩涡转动。翱翔高飞的黄鹤尚不能越渡，攀援敏捷的猿猱更一筹莫展。青泥河的小路曲折又蜿蜒，走一百步就要绕路而行，伸手可触星辰快快屏住呼吸，用手抚住胸口坐在地上叹息。请问你这次西方游历何时归？山路险道峭岩实在难以攀登。只听见古树枝头飞鸟在哀号，雄雌相随林间飞绕徘徊不前。又听见月夜里杜鹃声声哀鸣，悲声回荡在空山中愁情更添。\r\n蜀道难走比登上青天还要难。此情景即使听说也要变容颜！绵延的山峰离天不到一尺远，倒挂的枯松斜倚绝壁悬崖边。瀑布飞泻激流涌争相喧嚣，撞击山岩的巨石响声似惊雷。蜀道这般艰险你为何来比呢？更有崎岖高峻险恶的剑门关，一人把关万余人也休想进入。收官任若不可信则酿成大祸，那里早上躲猛虎晚间避长蛇。虎蛇磨牙吸人血好比斩乱麻，锦城虽说能享乐不如早回家。蜀道难走比登上青天还要难，回身向西望禁不住怅惘长叹。[4] '),
(9, 10, 1, '行路难', '其一<br/>\r\n金樽（zūn）清酒斗十千，玉盘珍羞（xiū）直万钱。<br/>\r\n停杯投箸(zhù)不能食，拔剑四顾心茫然。<br/>\r\n欲渡黄河冰塞（sè）川，将登太行雪满山。(一说：雪暗天）<br/>\r\n闲来垂钓碧溪上，忽复乘舟梦日边。<br/>\r\n行路难！行路难！多歧（qí）路，今安在？<br/>\r\n长风破浪会有时，直挂云帆济(jì)沧海。[1]<br/> \r\n其二<br/>\r\n大道如青天，我独不得出。<br/>\r\n羞逐长安社中儿，赤鸡白雉（zhì）赌梨栗。<br/>\r\n弹剑作歌奏苦声，曳裾（yèjū）王门不称情。<br/>\r\n淮阴市井笑韩信，汉朝公卿忌贾生。<br/>\r\n君不见昔时燕家重郭隗（wěi），拥篲（huì）折节无嫌猜。<br/>\r\n剧辛乐毅感恩分，输肝剖胆效英才。<br/>\r\n昭王白骨萦（yíng）蔓草，谁人更扫黄金台？<br/>\r\n行路难，归去来！[2] <br/>\r\n其三<br/>\r\n有耳莫洗颍（yǐng）川水，有口莫食首阳蕨（jué）。<br/>\r\n含光混世贵无名，何用孤高比云月？<br/>\r\n吾观自古贤达人，功成不退皆殒（yǔn）身。<br/>\r\n子胥（xū）既弃吴江上，屈原终投湘水滨。<br/>\r\n陆机雄才岂自保？李斯税（tuō）驾苦不早。<br/>\r\n华亭鹤唳（lì）讵（jù）可闻？上蔡苍鹰何足道？<br/>\r\n君不见吴中张翰称达生，秋风忽忆江东行。<br/>\r\n且乐生前一杯酒，何须身后千载名？[3] <br/>', '1.行路难：乐府《杂曲歌辞》调名，古乐府道路六曲之一，亦有变行路难，内容多写社会道途艰难及离别悲伤之意，多以“君不见”为首，后鲍照拟作为多。<br/>\r\n2.直：古时通"值"。<br/>\r\n3.金樽：古代盛酒的器具，以金为饰。清酒：清醇的美酒。斗十千：一斗值十千钱（即万钱），形容酒美价高。玉盘：精美的食具。珍羞：珍美的菜肴。羞：通“馐”，佳肴，美味的食物。直：通“值”，价值，价钱。<br/>\r\n4.投箸：丢下筷子。箸（zhù）：筷子。不能食：咽不下。茫然：无所适从。<br/>\r\n5.塞：堵塞。太行：太行山，现山西、河南、河北三省交界处。雪满山，一作“雪暗天”。详细说明：根据《平水韵》来看，这里一句的“川”和下一句的“边”都是属于下平一先，而“山”属于上平十五删。而“天”才是同在下平一先中的字。《平水韵》是后人总结唐人的用韵，总结的时候不可能把”山“这样的常见字放错位置，更不可能忽略这篇李白的名篇。<br/>\r\n6.闲来垂钓碧溪上，忽复乘舟梦日边：这两句暗用典故：姜太公吕尚曾在渭水的磻溪上钓鱼，得遇周文王，助周灭商；伊尹曾梦见自己乘船从日月旁边经过，后被商汤聘请，助商灭夏。吕尚和伊尹都曾辅佐帝王建立不朽功业，诗人借此表明自己对从政仍有所期待。碧：一作“坐”。忽复：忽然又。<br/>\r\n7.多歧路，今安在：岔道这么多，如今身在何处？歧：一作“岐”，岔路。今安在：意思是今后欲何往。安：哪里。<br/>\r\n8.长风破浪：比喻施展政治抱负。据《宋书·宗悫传》载：宗悫少年时，叔父宗炳问他的志向，他说：“愿乘长风破万里浪。”会：当。云帆：高高的船帆。船在海里航行，因天水相连，船帆好像出没在云雾之中。济：渡过。沧海：大海。<br/>\r\n9.社：古二十五家为一社。雉：野鸡。<br/>\r\n10.弹剑：战国时齐公子孟尝君门下食客冯谖曾屡次弹剑作歌怨己不如意。<br/>\r\n11.贾生：洛阳贾谊，曾上书汉文帝，劝其改制兴礼，受时大臣反对。<br/>\r\n12.拥篲：燕昭王亲自扫路，恐灰尘飞扬，用衣袖挡帚以礼迎贤士。折节：一作“折腰”。\r\n13.归去来：指隐居。语出东晋陶渊明《归去来辞》。<br/>\r\n14.首阳蕨：《史记·伯夷列传》：“武王已平殷乱，天下宗周，而伯夷、叔齐耻之，义不食周粟，隐于首阳山，采薇而食之……遂饿死于首阳山。”《索引》：“薇，蕨也。”按薇、蕨本二草，前人误以为一。<br/>\r\n15.含光混世贵无名：此句言不露锋芒，随世俯仰之意。《高士传》：巢父谓许由曰：“何不隐汝形，藏汝光？”<br/>\r\n16.自古贤达人：鲍照《拟行路难》：“自古圣贤尽贫贱”。功成不退皆殒身：《史记·蔡泽列传》：“四时之序，成功者去。商君为秦孝公明法令，功已成矣，而遂以车裂。白起功已成矣，而遂赐剑死于杜邮。吴起功已成矣，而卒枝解。大夫种为越王深谋远计令越成霸，功已彰而信矣，勾践终负而杀之。此四子者，功成不去，祸至于身？”<br/>\r\n17.子胥：伍子胥，春秋末期吴国大夫。《吴越春秋》卷五《夫差内传》：“吴王闻子胥之怨恨也，乃使人赐属镂之剑，子胥遂伏剑而死。吴王乃取子胥尸，盛以鸱夷之器，投之于江中。”又见《国语·吴语》。<br/>\r\n18.陆机雄才岂自保：《晋书·陆机传》载：陆机因宦人诬陷而被杀害于军中，临终叹曰：“华亭鹤唳，岂可复闻乎？”李斯税驾苦不早：李斯，秦国统一六国的大功臣，任秦朝丞相，后被杀。《史记·李斯列传》载：李斯喟然叹曰：“斯乃上蔡布衣今人臣之位，无居臣上者，可谓富贵极矣。物极则衰，吾未知所税驾？”《索引》：“税驾，犹解驾，言休息也。”<br/>\r\n19.华亭鹤唳讵可闻？上蔡苍鹰何足道：这两句还是写陆机和李斯。《史记·李斯列传》：“二世二年七月，具斯五刑，论腰斩咸阳市。斯出狱，与其中子俱执，顾谓其中子曰：‘吾欲与若复牵黄犬俱出上蔡东门逐狡兔，岂可得乎！’”《太平御览》卷九二六：《史记》曰：“李斯临刑，思牵黄犬、臂苍鹰，出上蔡门，不可得矣。”<br/>\r\n20.秋风忽忆江东行：这句写张翰。《晋书·张翰传》：“张翰，字季鹰，吴郡吴人也。为大司马东曹掾。因见秋风起，乃思吴中菰菜、莼羹、鲈鱼脍，曰：‘人生贵得适志，何能羁官数千里，以要名爵乎？’遂命驾而归。或谓之曰：‘卿乃纵适一时，独不为身后名邪？’答曰：‘使我有身后名，不如即时一杯酒。’时人贵其旷达。”[1]  [4] <br/>', '其一<br/>\r\n金杯中的美酒一斗价十千，玉盘里的菜肴珍贵值万钱。\r\n但心情愁烦使得我放下杯筷，不愿进餐。拔出宝剑环顾四周，心里一片茫然。\r\n想渡过黄河，坚冰堵塞大川；想登太行山，大雪遍布高山。\r\n遥想当年，姜太公溪边垂钓，得遇重才的文王，伊尹乘舟梦日，受聘在商汤身边。\r\n人生的道路何等艰难，何等艰难，歧路纷杂，真正的大道究竟在哪边？\r\n坚信乘风破浪的时机定会到来，到那时，将扬起征帆远渡碧海青天。[5]<br/>\r\n其二<br/>\r\n人生道路如此宽广，唯独我没有出路。\r\n我不愿意追随长安城中的富家子弟，去搞斗鸡走狗一类的赌博游戏。\r\n像冯谖那样弹剑作歌发牢骚，在权贵之门卑躬屈节是不合我心意的。\r\n当年淮阴市人讥笑韩信怯懦无能，汉朝公卿大臣嫉妒贾谊才能超群。\r\n你看，古时燕昭王重用郭隗，拥篲折节、谦恭下士，毫不嫌疑猜忌。\r\n剧辛和乐毅感激知遇的恩情，竭忠尽智，以自己的才能来报效君主。\r\n然而燕昭王早就死了，还有谁能像他那样重用贤士呢？\r\n世路艰难，我只得归去啦！[6] <br/>\r\n其三<br/>\r\n不要学许由用颍水洗耳，不要学伯夷和叔齐隐居首阳采薇而食。\r\n在世上活着贵在韬光养晦，为什么要隐居清高自比云月？\r\n我看自古以来的贤达之人，功绩告成之后不自行隐退都死于非命。\r\n伍子胥被吴王弃于吴江之上，屈原最终抱石自沉汨罗江中。\r\n陆机如此雄才大略也无法自保，李斯以自己悲惨的结局为苦。\r\n（陆机）是否还能听见华亭的别墅间的鹤唳？（李斯）是否还能在上蔡东门牵鹰打猎？\r\n你不知道吴中的张翰是个旷达之人，因见秋风起而想起江东故都。\r\n生时有一杯酒就应尽情欢乐，何须在意身后千年的虚名？[6] '),
(10, 11, 3, '归去来兮辞', '余家贫，耕植不足以自给。幼稚盈室，缾无储粟，生生所资，未见其术。亲故多劝余为长吏，脱然有怀，求之靡途。会有四方之事，诸侯以惠爱为德，家叔以余贫苦，遂见用于小邑。于时风波未静，心惮远役，彭泽去家百里，公田之利，足以为酒。故便求之。及少日，眷然有归欤之情。何则？质性自然，非矫厉所得。饥冻虽切，违己交病。尝从人事，皆口腹自役。于是怅然慷慨，深愧平生之志。犹望一稔，当敛裳宵逝。寻程氏妹丧于武昌，情在骏奔，自免去职。仲秋至冬，在官八十余日。因事顺心，命篇曰《归去来兮》。乙巳岁十一月也 。[2] <br/>\r\n归去来兮，田园将芜胡不归？既自以心为形役，奚惆怅而独悲？悟已往之不谏，知来者之可追。实迷途其未远，觉今是而昨非。舟遥遥以轻飏，风飘飘而吹衣。问征夫以前路，恨晨光之熹微。<br/>\r\n乃瞻衡宇，载欣载奔。僮仆欢迎，稚子候门。三径就荒，松菊犹存。携幼入室，有酒盈樽。引壶觞以自酌，眄庭柯以怡颜。倚南窗以寄傲，审容膝之易安。园日涉以成趣，门虽设而常关。策扶老以流憩，时矫首而遐观。云无心以出岫，鸟倦飞而知还。景翳翳以将入，抚孤松而盘桓。<br/>\r\n归去来兮，请息交以绝游。世与我而相违，复驾言兮焉求？悦亲戚之情话，乐琴书以消忧。农人告余以春及，将有事于西畴。或命巾车，或棹孤舟。既窈窕以寻壑，亦崎岖而经丘。木欣欣以向荣，泉涓涓而始流。善万物之得时，感吾生之行休。<br/>\r\n已矣乎！寓形宇内复几时？曷不委心任去留？胡为乎遑遑欲何之？富贵非吾愿，帝乡不可期。怀良辰以孤往，或植杖而耘耔。登东皋以舒啸，临清流而赋诗。聊乘化以归尽，乐夫天命复奚疑！[3] <br/>', '序文注释<br/>\r\n1.耕植不足以自给：耕：耕田。植：植桑。以：来。给：供给。<br/>\r\n2.幼稚盈室，缾无储粟：幼稚：指孩童。盈：满。缾：同”瓶“：指盛米用的陶制容器、如甏（bèng）、瓮之类。<br/>\r\n3.生生所资，未见其术：生生：犹言维持生计。前一“生”字为动词，后一“生”字为名词。资：凭借。术：这里指经营生计的本领。<br/>\r\n4.长吏：较高职位的县吏。指小官。<br/>\r\n5.脱然：轻快的样子。有怀：有所思念（指有了做官的念头）。<br/>\r\n6.靡途：没有门路。<br/>\r\n7.会有四方之事：刚巧碰上有出使到外地去的事情。会：适逢。四方：意为到各处去。<br/>\r\n8.诸侯：指州郡长官。<br/>\r\n9.家叔：指陶夔（kuí），当时任太常卿。以：因为。<br/>\r\n10.见：被。<br/>\r\n11.风波：指军阀混战。静：平。<br/>\r\n12.惮：害怕。役：服役。<br/>\r\n13.彭泽：县名。在今江西省湖口县东。<br/>\r\n14.眷然：依恋的样子。归欤（yú）之情：回去的心情。<br/>\r\n15.何：什么。则：道理。<br/>\r\n16.质性：本性。矫厉：造作勉强。<br/>\r\n17.切：迫切。违己：违反自己本心。 交病：指思想上遭受痛苦。<br/>\r\n18.尝：曾经。从人事：从事于仕途中的人事交往。指做官。<br/>\r\n19.口腹自役：为了满足口腹的需要而驱使自己。<br/>\r\n20.怅然：失意。<br/>\r\n21.犹：仍然。望：期待。一稔（rěn）：公田收获一次。稔，谷物成熟。<br/>\r\n22.敛裳：收拾行装。宵：星夜。逝：离去。<br/>\r\n23.寻：不久。程氏妹：嫁给程家的妹妹。武昌：今湖北省鄂城县。<br/>\r\n24.情：吊丧的心情。在：像。骏奔：急着前去奔丧。<br/>\r\n25.仲秋：农历八月。<br/>\r\n26.事：辞官。顺：顺遂。心：心愿。<br/>\r\n27.乙巳岁：晋安帝义熙元年。[4]<br/> \r\n正文注释<br/>\r\n1.归去来兮：意思是“回去吧”。来，助词，无义。兮，语气词。<br/>\r\n2.田园将芜胡不归：田园将要荒芜了，为什么不回去？胡，同“何”。<br/>\r\n3.以心为形役：让心神为形体所役使。意思是本心不愿出仕，但为了免于饥寒，违背本意做了官。心，意愿。形，形体，指身体。役，奴役。<br/>\r\n4.奚惆怅而独悲：为什么悲愁失意。惆怅，失意的样子。<br/>\r\n5.悟已往之不谏：觉悟到过去做错了的事（指出仕）已经不能改正。谏，谏止，劝止。<br/>\r\n6.知来者之可追：知道未来的事（指归隐）还可以挽救。追，挽救，补救。<br/>\r\n7.实：确实。迷途：做官。其：大概。<br/>\r\n8.是：正确。非：错误。<br/>\r\n9.舟遥遥以轻飏（yáng）：船在水面上轻轻地飘荡着前进。遥遥，摇摆不定的样子。以，而。飏，飞扬，形容船行驶轻快的样子。<br/>\r\n10.征夫：行人而非征兵之人。以：把。后文中：“农人告余以春及”也是这样的。前：前面的。<br/>\r\n11.恨晨光之熹微：遗憾的是天刚刚放亮。恨：遗憾。熹微，微明，天未大亮。<br/>\r\n12乃瞻衡宇，载欣载奔：看见自己家的房子，心中欣喜，奔跑过去。瞻，远望。衡宇，简陋的房子。<br/>\r\n13.稚子：幼儿。<br/>\r\n14.三径就荒，松菊犹存：院子里的小路快要荒芜了，松菊还长在那里。三径，院中小路。汉朝蒋诩（xǔ）隐居之后，在院里竹下开辟三径，只于少数友人来往。后人以“三径”代指隐士所居。就，近于。<br/>\r\n15.盈樽：满杯。<br/>\r\n16.引：拿来。 觞（shāng）。眄（miǎn）庭柯以怡颜：看看院子里的树木，觉得很愉快。眄，斜看。这里是“随便看看”的意思。柯，树枝。以：为了。怡颜，使面容现出愉快神色。<br/>\r\n17.寄傲：寄托傲然自得的心情。傲，指傲世。<br/>\r\n18.审容膝之易安：觉得住在简陋的小屋里也非常舒服。审，觉察。容膝，只能容下双膝的小屋，极言其狭小。<br/>\r\n19.园日涉以成趣：天天到园里行走，自成一种乐趣。涉，涉足，走到。<br/>\r\n20.策扶老以流憩（qì）：拄着拐杖出去走走，随时随地休息。策，拄着。扶老，手杖。憩，休息。流憩，游息，就是没有固定的地方，到处走走歇歇。<br/>\r\n21.时矫首而遐观：时时抬起头向远处望望。矫，举。遐，远。<br/>\r\n22.云无心以出岫（xiù）：云气自然而然地从山里冒出。无心，无意地。岫，有洞穴的山，这里泛指山峰。<br/>\r\n23.景翳（yì）翳以将入：阳光黯淡，太阳快落下去了。景，日光。翳翳，阴暗的样子。<br/>\r\n24.扶孤松而盘桓：手扶孤松徘徊。盘桓：盘旋，徘徊，留恋不去。<br/>\r\n25.请息交以绝游：息交，停止与人交往断绝交游。意思是不再同官场有任何瓜葛。<br/>\r\n26.世与我而相违，复驾言兮焉求：世事与我所想的相违背，还能努力探求什么呢？驾，驾车，这里指驾车出游去追求想要的东西。言，助词。<br/>\r\n27.情话：知心话。<br/>\r\n28.春及：春天到了。<br/>\r\n29.将有事于西畴：西边田野里要开始耕种了。有事，指耕种之事。事，这里指农事。畴，田地。<br/>\r\n30.或命巾车：有时叫上一辆有帷的小车。巾车，有车帷的小车。或，有时。<br/>\r\n31.或棹（zhào）孤舟：有时划一艘小船。棹，本义船桨。这里名词做动词，意为划桨。<br/>\r\n32.既窈窕以寻壑：经过幽深曲折的山谷。窈窕，幽深曲折的样子。壑，山沟。<br/>\r\n33.亦崎岖而经丘：走过高低不平的山路。<br/>\r\n34.木欣欣以向荣：草木茂盛。欣欣，向荣，都是草木滋长茂盛的意思。<br/>\r\n35.涓涓：水流细微的样子。<br/>\r\n36.善万物之得时，感吾生之行休：羡慕自然界万物一到春天便及时生长茂盛，感叹自己的一生行将结束。善，欢喜，羡慕。行休，行将结束。<br/>\r\n37.已矣乎：算了吧!助词“矣”与“乎”连用，加强感叹语气。<br/>\r\n38.寓形宇内复几时，曷（hé）不委心任去留：活在世上能有多久，何不顺从自己的心愿，管它什么生与死呢？寓形，寄生。宇内，天地之间。曷，何。委心，随心所欲。去留，指生死。<br/>\r\n39.胡为乎遑遑欲何之：为什么心神不定，想到哪里去呢？遑遑，不安的样子。之，往。<br/>\r\n40.帝乡不可期：仙境到不了。帝乡，仙乡，神仙居住的地方。期，希望，企及。<br/>\r\n41.怀良辰以孤往：爱惜美好的时光，独自外出。怀，留恋、爱惜。良辰，指上文所说万物得时的春天。孤 独，独自外出。<br/>\r\n42.或植杖而耘耔：有时扶着拐杖除草培苗。植，立，扶着。耘，除草。耘，除草。籽，培苗。<br/>\r\n43.登东皋（gāo）以舒啸：登上东面的高地放声长啸，皋，高地。啸，撮口发出的长而清越的一种声音。舒，放。<br/>\r\n44.聊乘化以归尽：姑且顺其自然走完生命的路程。聊：姑且。乘化，随顺大自然的运转变化。归尽：到死。尽，指死亡。<br/>\r\n45.乐夫天命复奚疑：乐安天命，还有什么可疑虑的呢？ 复：还有。疑：疑虑。[4]  [5] <br/>', '序文<br/>\r\n我家贫穷，耕田植桑不足以供自己生活。孩子很多，米缸里没有剩余的粮食，赖以维持生计的本领我还没有找到。亲友大都劝我去做官，我心里也有这个念头，可是求官缺少门路。正赶上出使到外地的事情，地方大吏以爱惜人才为美德，叔父也因为我家境贫苦（替我设法），我就被委任到小县做官。那时社会上动荡不安，心里惧怕到远处当官。彭泽县离家一百里，公田收获的粮食，足够造酒饮用，所以就请求去那里。等到过了一些日子，便产生了留恋故园的怀乡感情。那是为什么？本性任其自然，这是勉强不得的；饥寒虽是急需解决的问题，但是违背本意去做官，身心都感痛苦。过去为官做事，都是为了吃饭而役使自己。于是惆怅感慨，心情激动不平，深深有愧于平生的志愿。仍然希望看到这一茬庄稼成熟，便收拾行装连夜离去。不久，嫁到程家的妹妹在武昌去世，去吊丧的心情像骏马奔驰一样急迫，自己请求免去官职。自立秋第二个月到冬天，在职共80多天。因辞官而顺遂了心愿，写了一篇文章，题目叫《归去来兮》。乙巳年（晋安帝义熙元年）十一月。<br/>\r\n正文<br/>\r\n回去吧！田园都将要荒芜了，为什么不回去呢？既然自己的心灵被躯壳所役使，那为什么悲愁失意？我明悟过去的错误已不可挽回，但明白未发生的事尚可补救。我确实入了迷途，但不算太远，已觉悟如今的选择是正确的，而曾经的行为才是迷途。船在水面轻轻地飘荡着前进，轻快前行，风轻飘飞舞，吹起了衣袂翩翩。我向行人询问前面的路，恨天亮的太慢。\r\n终于看到了自己的家，心中欣喜，奔跑过去。家僮欢快地迎接我，幼儿们守候在门庭等待。院子里的小路快要荒芜了，松菊还长在那里。我带着幼儿们进入屋室，早有清酿溢满了酒樽。我端起酒壶酒杯自斟自饮，看看院子里的树木，觉得很愉快；倚着南窗寄托傲然自得的心情，觉得住在简陋的小屋里也非常舒服。天天到院子里走走，自成一种乐趣,小园的门经常地关闭，拄着拐杖出去走走，随时随地休息，时时抬头望着远方。云气自然而然的从山里冒出，倦飞的小鸟也知道飞回巢中；阳光黯淡，太阳快落下去了，手抚孤松徘徊。\r\n回来呀！我要跟世俗之人断绝交游。世事与我所想的相违背，还能努力探求什么呢？以亲人间的知心话为愉悦，以弹琴读书为乐来消除忧愁。农夫告诉我春天到了，西边田野里要开始耕种了。有时叫上一辆有帷的小车，有时划过一艘小船。有时经过幽深曲折的山谷，有时走过高低不平的山路。草木茂盛，水流细微。羡慕自然界的万物一到春天便及时生长茂盛，感叹自己的一生行将结束。\r\n算了吧！活在世上还能有多久，为什么不放下心来任其自然地生死？为什么心神不定，想要到哪里去？富贵不是我所求，修成神仙是没有希望的。趁着春天美好的时光，独自外出。有时放下手杖，拿起农具除草培土；登上东边的高岗放声呼啸，傍着清清的溪流吟诵诗篇。姑且顺其自然走完生命的路程，抱定乐安天命的主意，还有什么可犹疑的呢！[6] ');

-- --------------------------------------------------------

--
-- 表的结构 `c_poem`
--

CREATE TABLE IF NOT EXISTS `c_poem` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(50) NOT NULL,
  `author` varchar(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=62 ;

--
-- 转存表中的数据 `c_poem`
--

INSERT INTO `c_poem` (`id`, `title`, `author`) VALUES
(1, '望庐山瀑布', '李白'),
(2, '静夜思', '李白'),
(4, '早发白帝城', '李白'),
(5, '夜宿山寺', '李白'),
(6, '送孟浩然之广陵', '李白'),
(7, '望天门山', '李白'),
(8, '独坐敬亭山', '李白'),
(9, '蜀道难', '李白'),
(10, '行路难', '李白'),
(11, '归去来兮辞', '陶渊明'),
(12, '从军行', '李白'),
(13, '峨眉山月歌', '李白'),
(14, '春夜洛城闻笛', '李白'),
(15, '赠汪伦', '李白'),
(16, '登金陵凤凰台', '李白'),
(17, '长歌行', '李白'),
(18, '春夜喜雨', '杜甫'),
(19, '闻军官收河南河北', '杜甫'),
(20, '石壕吏', '杜甫'),
(21, '登高', '杜甫'),
(22, '登岳阳楼', '杜甫'),
(23, '江南', '汉乐府'),
(24, '咏鹅', '骆宾王'),
(25, '咏柳', '贺知章'),
(26, '凉州词', '王之焕'),
(27, '登鹳(guàn)雀楼', '王之焕'),
(28, '春晓', '孟浩然'),
(29, '凉州词', '王翰'),
(30, '出塞', '王昌龄'),
(31, '送元二使安西', '王维'),
(32, '九月九日忆山东兄弟', '王维'),
(33, '古朗月行', '李白'),
(34, '望天门山', '李白'),
(35, '别董大', '高适'),
(36, '绝句', '杜甫'),
(37, '春夜喜雨', '杜甫'),
(38, '枫桥夜泊', '张继'),
(39, '游子吟', '孟郊'),
(40, '江雪', '柳宗元'),
(41, '渔歌子', '张志和'),
(42, '望洞庭', '刘禹锡'),
(43, '浪淘沙', '刘禹锡'),
(44, '忆江南', '白居易'),
(45, '小儿垂钓', '胡令能'),
(46, '寻隐者不遇', '贾岛'),
(47, '山行', '杜牧'),
(48, '清明', '杜牧'),
(49, '江上渔者', '范仲淹'),
(50, '饮湖上初晴后雨', '苏轼'),
(51, '题西林壁', '苏轼'),
(52, '夏日绝句', '李清照'),
(53, '示儿', '陆游'),
(54, '小池', '杨万里'),
(55, '晓出净慈寺送林子方', '杨万里'),
(56, '游园不值', '叶绍翁'),
(57, '墨梅', '王冕(miǎn)'),
(58, '石灰吟', '于谦'),
(59, '竹石', '郑燮(xiè)'),
(60, '所见', '袁枚'),
(61, '己(yǐ)亥(hài)杂诗', '龚自珍'),
(3, '念奴娇·赤壁怀古', '苏轼');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
