-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2016-04-25 08:15:43
-- 服务器版本： 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `china_culture`
--

-- --------------------------------------------------------

--
-- 表的结构 `c_article`
--

CREATE TABLE IF NOT EXISTS `c_article` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(50) NOT NULL,
  `author` varchar(20) NOT NULL,
  `time` date NOT NULL,
  `file_name` varchar(20) NOT NULL,
  `represent` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

--
-- 转存表中的数据 `c_article`
--

INSERT INTO `c_article` (`id`, `title`, `author`, `time`, `file_name`, `represent`) VALUES
(1, '浮伤年华,让泪化作相思雨', '落花飘零', '2016-04-22', 'test.xml', '那一年初秋，我和你在雨中相遇。我撑着伞悠然地在雨帘中行走，而你被雨淋得一身狼狈，却毫不在意，还露出愉悦的表情。和你擦肩而过的那一刻，我想要回头叫住你，想知道你为什么会在雨中笑得那么开心。可是最后我只是握紧了伞柄继续向前走，而你永远也不知道就在那短短的几秒里你走进了我的心里，依然阔步向前。我们的距离越来越远，当我鼓起勇气回头的时候，你已经不见了，消失在那年初秋的第一场雨中。'),
(2, '有人就有江湖，有江湖就有恩怨', '未知', '2016-04-22', 'jianghu.xml', '有人就有江湖，有江湖就有恩怨，人就是江湖，你怎么退出？真正的寂寞是在骨子里的，是觉得全世界只剩下了自己。欲将轻骑逐，大雪满弓刀，这势必是一场鏖战！御剑江湖载酒行，美人如玉翩若鸿。十年一剑情如梦，赢得生前身后名。我只是隐约地看到一个风华正茂的年轻剑客，缓缓的收起自己的剑，抬脚踏出了自己的江湖路。开始想念，那曾经握在手中苍凉的岁月，以及那一片灿烂的江湖，还有那些曾经爱过恨过的人们。 '),
(3, '书剑恩仇录', '金庸', '1955-01-01', 'shujian.xml', '周绮身孕在身，留在福建生产；陈家洛和其他英雄赶往京城。此时回部全军覆没，香香公主被擒，乾隆欲据为己有，香香公主宁死不从。陈家洛与乾隆相见，以国家利益为重，答应帮助劝说香香公主；香香公主含泪答应了陈家洛，后发现乾隆并不真想反清复明，遂自杀以示陈家洛。陈家洛伤心之余，抱着最后一线希望进入皇宫，险被毒死。众英雄大开杀戒，天山双鹰与红花会十当家章进身亡，最后捉住乾隆。'),
(4, '来世，等你在天青色的雨巷', '未知', '2016-04-22', 'laishi.xml', '幽思入琴弦，心开如莲。轻声昵咛，柔情呼唤。一想一眷恋，一思一哀伤。镜中瘦颜，青丝一寸，愁绪一丈。书中长恨，泪墨惨淡尘土。“落花人独立，微雨燕双飞。”一缕相思于眉间清清浅浅，浅浅清清。一抹柔情于指间千回百转百转千回。杏花细雨，揉不碎曾经的过往，荡不尽逝水流年。如莲心事一念成痴，尘缘如梦，思念悠悠云水长');

-- --------------------------------------------------------

--
-- 表的结构 `c_author`
--

CREATE TABLE IF NOT EXISTS `c_author` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `a_name` varchar(20) NOT NULL,
  `a_dynasty` varchar(10) NOT NULL,
  `a_describe` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `c_author`
--

INSERT INTO `c_author` (`id`, `a_name`, `a_dynasty`, `a_describe`) VALUES
(1, '李白', '唐代', '李白（701年－762年）[1]  ，字太白，号青莲居士，又号“谪仙人”，汉族，绵州昌隆县（今四川省江油市）人，是唐代伟大的浪漫主义诗人，被后人誉为“诗仙”。与杜甫并称为“李杜”，为了与另两位诗人李商隐与杜牧即“小李杜”区别，杜甫与李白又合称“大李杜”。其人爽朗大方，爱饮酒作诗，喜交友。\r\n李白深受黄老列庄思想影响，有《李太白集》传世，诗作中多以醉时写的，代表作有《望庐山瀑布》、《行路难》、《蜀道难》、《将进酒》、《梁甫吟》、《早发白帝城》等多首。\r\n李白所作词赋，宋人已有传记（如文莹《湘山野录》卷上），就其开创意义及艺术成就而言，“李白词”享有极为崇高的地位。');

-- --------------------------------------------------------

--
-- 表的结构 `c_idiom`
--

CREATE TABLE IF NOT EXISTS `c_idiom` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `content` varchar(20) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=117 ;

--
-- 转存表中的数据 `c_idiom`
--

INSERT INTO `c_idiom` (`id`, `content`) VALUES
(1, '天下无双'),
(2, '金玉良缘'),
(3, '霸王别姬'),
(4, '偷天换日'),
(5, '满腹经纶'),
(6, '情非得已'),
(7, '珠光宝气'),
(8, '两小无猜'),
(9, '兵临城下'),
(10, '纸上谈兵'),
(11, '声东击西'),
(12, '南辕北辙'),
(13, '草木皆兵'),
(14, '虚有其表'),
(15, '金玉满堂'),
(16, '天上人间'),
(17, '海阔天空'),
(18, '春暖花开'),
(19, '国色天香'),
(20, '倾国倾城'),
(21, '插翅难逃'),
(22, '在劫难逃'),
(23, '掌上明珠'),
(24, '卧虎藏龙'),
(25, '相亲相爱'),
(26, '逍遥法外'),
(27, '皆大欢喜'),
(28, '度日如年'),
(29, '绘声绘色'),
(30, '百里挑一'),
(31, '背水一战'),
(32, '万箭穿心'),
(33, '长生不死'),
(34, '金枝玉叶'),
(35, '滔滔不绝'),
(36, '壮志凌云'),
(37, '卧薪尝胆'),
(38, '相濡以沫'),
(39, '落叶归根'),
(40, '海市蜃楼'),
(41, '惊天动地'),
(42, '愚公移山'),
(43, '天地不容'),
(44, '抛砖引玉'),
(45, '窈窕淑女'),
(46, '无地自容'),
(47, '无忧无虑'),
(48, '高山流水'),
(49, '相见恨晚'),
(50, '四海为家'),
(51, '生财有道'),
(52, '破釜沉舟'),
(53, '天涯海角'),
(54, '精忠报国'),
(55, '亡羊补牢'),
(56, '千军万马'),
(57, '妄自菲薄'),
(58, '出生入死'),
(59, '英雄豪杰'),
(60, '学富五车'),
(61, '石破天惊'),
(62, '福星高照'),
(63, '随遇而安'),
(64, '翻雨覆雨'),
(65, '饮食男女'),
(66, '郑人买履'),
(67, '鹰击长空'),
(68, '万家灯火'),
(69, '棋逢对手'),
(70, '叶公好龙'),
(71, '后会无期'),
(72, '守株待兔'),
(73, '一生一世'),
(74, '花好月圆'),
(75, '树外桃园'),
(76, '韬光养晦'),
(77, '画蛇添足'),
(78, '青梅竹马'),
(79, '风花雪月'),
(80, '滥竽充数'),
(81, '总而言之'),
(82, '没完没了'),
(83, '欣欣向荣'),
(84, '时光荏苒'),
(85, '差强人意'),
(86, '好好先生'),
(87, '无懈可击'),
(88, '随波逐流'),
(89, '袖手旁观'),
(90, '群雄逐鹿'),
(91, '血战到底'),
(92, '唯我独尊'),
(93, '买椟还珠'),
(94, '龙马精神'),
(95, '一见钟情'),
(96, '喜闻乐见'),
(97, '负荆请罪'),
(98, '三人成虎'),
(99, '程门立雪'),
(100, '金戈铁马'),
(101, '笑逐颜开'),
(102, '千钧一发'),
(103, '大器晚成'),
(104, '风和日丽'),
(105, '庖丁解牛'),
(106, '甜言蜜语'),
(107, '雷霆万钧'),
(108, '邯郸学步'),
(109, '大开眼界'),
(110, '汗牛充栋'),
(111, '百鸟朝凤'),
(112, '以德服人'),
(113, '白驹过隙'),
(114, '指鹿为马'),
(115, '龙争虎斗'),
(116, '未雨绸缪');

-- --------------------------------------------------------

--
-- 表的结构 `c_pdetail`
--

CREATE TABLE IF NOT EXISTS `c_pdetail` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `p_id` int(11) NOT NULL,
  `p_author_id` int(11) NOT NULL,
  `title` varchar(50) NOT NULL,
  `p_content` text NOT NULL,
  `p_note` text NOT NULL,
  `p_analysis` text NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `p_id` (`p_id`),
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;

--
-- 转存表中的数据 `c_pdetail`
--

INSERT INTO `c_pdetail` (`id`, `p_id`, `p_author_id`, `title`, `p_content`, `p_note`, `p_analysis`) VALUES
(1, 3, 1, '望庐山瀑布', '望庐山瀑布二首⑴<br/>\r\n其一<br/>\r\n西登香炉峰⑵，南见瀑布水⑶。\r\n挂流三百丈⑷，喷壑数十里⑸。<br/>\r\n欻如飞电来，隐若白虹起⑹。\r\n初惊河汉落⑺，半洒云天里⑻。<br/>\r\n仰观势转雄，壮哉造化功⑼。\r\n海风吹不断，江月照还空⑽。<br/>\r\n空中乱潈射，左右洗青壁⑾；\r\n飞珠散轻霞，流沫沸穹石⑿。<br/>\r\n而我乐名山⒀，对之心益闲⒁；\r\n无论漱琼液⒂，还得洗尘颜⒃。<br/>\r\n且谐宿所好，永愿辞人间⒄。<br/>\r\n其二<br/>\r\n日照香炉生紫烟，遥看瀑布挂前川⒅。<br/>\r\n飞流直下三千尺⒆，疑是银河落九天⒇。<br/>', '⑴庐山：又名匡山，中国名山之一。位于今江西省九江市北部的鄱阳湖盆地，在庐山区境内，耸立于鄱阳湖、长江之滨。<br/>\r\n⑵香炉峰：庐山香炉峰有四。此指南香炉峰。因烟云聚散，如香炉之状，故名。关于香炉峰的位置，各注本有多种说法。<br/>\r\n⑶南见：一作“南望”。<br/>\r\n⑷三百丈：一作“三千匹”。<br/>\r\n⑸“喷壑”句：意谓瀑布喷射山谷，一泻数十里。壑（hè）：坑谷。<br/>\r\n⑹“欻如”二句：意谓快如闪电而来，隐似白虹而起。此二句化用沈约《八咏诗·被褐守山东》“掣曳写流电，奔飞似白虹”句意。歘（xū）：迅疾貌。飞电：空中闪电。一作“飞练”。隐若：一作“宛若”。白虹：一种出现在雾上的淡白色的虹。<br/>\r\n⑺河汉：银河，又称天河。一作“银河”。<br/>\r\n⑻“半洒”句：一作“半泻金潭里”。<br/>\r\n⑼造化：自然界的创造者，此指大自然。<br/>\r\n⑽“江月”句：意谓瀑布在江月的映照下，显得更加清澈。江月：一作“山月”。<br/>\r\n⑾“空中”二句：意谓瀑布在奔流过程中所激起的水花，四处飞溅，冲刷着左右青色的山壁。潈（zōng）：众水汇在一起。<br/>\r\n⑿穹（qióng）石：高大的石头。<br/>\r\n⒀乐：爱好。乐名山：一作“游名山”。<br/>\r\n⒁益：更加。闲：宽广的意思。<br/>\r\n⒂无论：不必说。漱：漱洗。琼液：传说中仙人的饮料。此指山中清泉。<br/>\r\n⒃还得：但得。一作“且得”。尘颜：沾满风尘的脸。洗尘颜：喻指洗除在尘世中所沾染的污垢。<br/>\r\n⒄“且谐”二句：一作“集谱宿所好，永不归人间”，又一作“爱此肠欲断，不能归人间”。谐：谐和。宿：旧。宿所好：素来的爱好。一解为旧友。<br/>\r\n⒅“日照”二句：一作“庐山上与星斗连，日照香炉生紫烟”。香炉：指香炉峰。紫烟：指日光透过云雾，远望如紫色的烟云。孟浩然《彭蠡湖中望庐山》：“香炉初上日，瀑布喷成虹。”遥看：从远处看。挂：悬挂。前川：一作“长川”。川：河流，这里指瀑布。<br/>\r\n⒆直：笔直。三千尺：形容山高。这里是夸张的说法，不是实指。<br/>\r\n⒇疑：怀疑。银河：古人指银河系构成的带状星群。九天：极言天高。古人认为天有九重，九天是天的最高层，九重天，即天空最高处。一作“半天”。此句极言瀑布落差之大。[2]  [3]  [4] ', '其一\r\n从西面登上庐山的香炉峰，看见南面瀑布高挂在山前。\r\n瀑布高高悬挂达到三百丈，喷涌出的溪水有数十里长。\r\n瀑布水流迅疾如同闪电般，时隐时现恰如空中升白虹。\r\n初看以为银河从九天垂落，河水从云天高处半洒而下。\r\n抬头仰观那气势更加雄伟，大自然造化之功多么壮阔！\r\n海天之风吹不断瀑布水练，江上明月照来又如同空无。\r\n瀑布水花在空中四溅乱射，冲洗着两侧青色的山石壁。\r\n水珠飞溅犹如轻霞般四散，流淌的水沫在巨石上翻滚。\r\n我平生素来喜爱游览名山，面临此瀑布更觉心里闲逸。\r\n不必说可吸饮如琼液之水，还可以用来洗去途中尘颜。\r\n还是与旧友相携一道到此，在这里隐居永远辞别人间。\r\n其二\r\n太阳照耀香炉峰生出袅袅紫烟，远远望去瀑布像长河悬挂山前。\r\n仿佛三干尺水流飞奔直冲而下，莫非是银河从九天垂落山崖间。[3] '),
(2, 2, 1, '静夜思', '床前明月光⑵，疑是地上霜⑶。<br>\r\n举头望明月⑷，低头思故乡。[1-2] ', '⑴静夜思：安静的夜晚产生的思绪。<br/>\r\n⑵床：此诗中的“床”字，是争论和异议的焦点。今传五种说法。①指井台。②指井栏。从考古发现来看，中国最早的水井是木结构水井。古代井栏有数米高，成方框形围住井口，防止人跌入井内，这方框形既像四堵墙，又像古代的床。因此古代井栏又叫银床，说明井和床有关系，其关系的发生则是由于两者在形状上的相似和功能上的类同。③“窗”的通假字。从意义上讲，“床”可能与‘窗’通假，而且在窗户前面是可能看到月亮的。但是，参照宋代版本，‘举头望山月’，便可证实作者所言乃是室外的月亮。从时间上讲，宋代版本比明代版本在对作者原意的忠诚度上，更加可靠。④取本义，即坐卧的器具，《诗经·小雅·斯干》有“载寐之牀”，《易·剥牀·王犊注》亦有“在下而安者也”之说，讲得即是卧具。⑤马未都等认为，床应解释为胡床。胡床，亦称“交床”、“交椅”、“绳床”。古时一种可以折叠的轻便坐具，马扎功能类似小板凳，但人所坐的面非木板，而是可卷折的布或类似物，两边腿可合起来。现代人常为古代文献中或诗词中的“胡床”或“床”所误。至迟在唐时，“床”仍然是“胡床”（即马扎，一种坐具）。<br/>\r\n⑶疑：好像。<br/>\r\n⑷举头：抬头。[4]  [5] ', '窗前洒满了银色的月光，好像地上结了一层薄霜。\r\n抬头凝望着空中的明月，不禁低头思念我的故乡。[6-7] ');

-- --------------------------------------------------------

--
-- 表的结构 `c_poem`
--

CREATE TABLE IF NOT EXISTS `c_poem` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(50) NOT NULL,
  `author` varchar(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=62 ;

--
-- 转存表中的数据 `c_poem`
--

INSERT INTO `c_poem` (`id`, `title`, `author`) VALUES
(3, '望庐山瀑布', '李白'),
(2, '静夜思', '李白'),
(4, '早发白帝城', '李白'),
(5, '夜宿山寺', '李白'),
(6, '送孟浩然之广陵', '李白'),
(7, '望天门山', '李白'),
(8, '独坐敬亭山', '李白'),
(9, '蜀道难', '李白'),
(10, '行路难 其一', '李白'),
(11, '行路难 其二', '李白'),
(12, '从军行', '李白'),
(13, '峨眉山月歌', '李白'),
(14, '春夜洛城闻笛', '李白'),
(15, '赠汪伦', '李白'),
(16, '登金陵凤凰台', '李白'),
(17, '长歌行', '李白'),
(18, '春夜喜雨', '杜甫'),
(19, '闻军官收河南河北', '杜甫'),
(20, '石壕吏', '杜甫'),
(21, '登高', '杜甫'),
(22, '登岳阳楼', '杜甫'),
(23, '江南', '汉乐府'),
(24, '咏鹅', '骆宾王'),
(25, '咏柳', '贺知章'),
(26, '凉州词', '王之焕'),
(27, '登鹳(guàn)雀楼', '王之焕'),
(28, '春晓', '孟浩然'),
(29, '凉州词', '王翰'),
(30, '出塞', '王昌龄'),
(31, '送元二使安西', '王维'),
(32, '九月九日忆山东兄弟', '王维'),
(33, '古朗月行', '李白'),
(34, '望天门山', '李白'),
(35, '别董大', '高适'),
(36, '绝句', '杜甫'),
(37, '春夜喜雨', '杜甫'),
(38, '枫桥夜泊', '张继'),
(39, '游子吟', '孟郊'),
(40, '江雪', '柳宗元'),
(41, '渔歌子', '张志和'),
(42, '望洞庭', '刘禹锡'),
(43, '浪淘沙', '刘禹锡'),
(44, '忆江南', '白居易'),
(45, '小儿垂钓', '胡令能'),
(46, '寻隐者不遇', '贾岛'),
(47, '山行', '杜牧'),
(48, '清明', '杜牧'),
(49, '江上渔者', '范仲淹'),
(50, '饮湖上初晴后雨', '苏轼'),
(51, '题西林壁', '苏轼'),
(52, '夏日绝句', '李清照'),
(53, '示儿', '陆游'),
(54, '小池', '杨万里'),
(55, '晓出净慈寺送林子方', '杨万里'),
(56, '游园不值', '叶绍翁'),
(57, '墨梅', '王冕(miǎn)'),
(58, '石灰吟', '于谦'),
(59, '竹石', '郑燮(xiè)'),
(60, '所见', '袁枚'),
(61, '己(yǐ)亥(hài)杂诗', '龚自珍');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
